.. _nif_userguide:

NIF Strings
============

Introduction
------------

The function :func:`clean_fr_nif() <dataprep.clean.clean_fr_nif.clean_fr_nif>` cleans a column containing French tax identification number (NIF) strings, and standardizes them in a given format. The function :func:`validate_fr_nif() <dataprep.clean.clean_fr_nif.validate_fr_nif>` validates either a single NIF strings, a column of NIF strings or a DataFrame of NIF strings, returning `True` if the value is valid, and `False` otherwise.

NIF strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "0701987765432"
* `standard`: NIF strings with proper whitespace in the proper places, like "07 01 987 765 432"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_fr_nif()` and `validate_fr_nif()`.

### An example dataset containing NIF strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "nif": [
            "0701987765432",
            "070198776543",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              nif                                           address
0   0701987765432                                     123 Pine Ave.
1    070198776543                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_fr_nif`

By default, `clean_fr_nif` will clean nif strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_fr_nif
clean_fr_nif(df, column = "nif")

,nif,address,nif_clean
0,0701987765432,123 Pine Ave.,07 01 987 765 432
1,070198776543,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_fr_nif(df, column = "nif", output_format="standard")

,nif,address,nif_clean
0,0701987765432,123 Pine Ave.,07 01 987 765 432
1,070198776543,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_fr_nif(df, column = "nif", output_format="compact")

,nif,address,nif_clean
0,0701987765432,123 Pine Ave.,0701987765432
1,070198776543,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned NIF strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_fr_nif(df, column="nif", inplace=True)

           nif_clean                                           address
0  07 01 987 765 432                                     123 Pine Ave.
1                NaN                                           main st
2                NaN                      1234 west main heights 57033
3                NaN                    apt 1 789 s maple rd manhattan
4                NaN                robie house, 789 north main street
5                NaN  (staples center) 1111 S Figueroa St, Los Angeles
6                NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_fr_nif(df, "nif", errors="coerce")

,nif,address,nif_clean
0,0701987765432,123 Pine Ave.,07 01 987 765 432
1,070198776543,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_fr_nif(df, "nif", errors="ignore")

,nif,address,nif_clean
0,0701987765432,123 Pine Ave.,07 01 987 765 432
1,070198776543,main st,070198776543
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_fr_nif()`

`validate_fr_nif()` returns `True` when the input is a valid NIF. Otherwise it returns `False`.

The input of `validate_fr_nif()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_fr_nif()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_fr_nif()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_fr_nif
print(validate_fr_nif("0701987765432"))
print(validate_fr_nif("070198776543"))
print(validate_fr_nif("51824753556"))
print(validate_fr_nif("51 824 753 556"))
print(validate_fr_nif("hello"))
print(validate_fr_nif(np.nan))
print(validate_fr_nif("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_fr_nif(df["nif"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: nif, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_fr_nif(df, column="nif")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: nif, dtype: bool

### Only DataFrame

In [11]:
validate_fr_nif(df)

     nif  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False